# 0. Data Formats

## Learning objectives
- Understand the basic file formats/uses of CSV, XLSX, JSON, and YAML.
- Know how to import them into pandas

# CSV
> ## CSV __(comma-separated values)__ files are a very common way to store data. 
- Their most common literal representation is a bunch of values, separated by commas, as the name would indicate.
- All of the data for a single observation is on one line: each new line is a new observation.
- The comma in this case is called the __'delimiter'__ as it shows the difference (or limit) between one value and the next.
- Other common delimiters are semi-colons and tabs (also called __tsv/tab-separated values__).
- We must be careful to check what exactly the delimiter is, as a common error is reading in a file with the wrong delimiter, and so getting a weird representation in your data.
- CSVs can also be read by Excel.
<p style="font-size:10.5px">
Usually if you are using data from mainland European countries (France/Spain etc) they will use semi-colons, hence some people prefer <i>character</i>-separated values for CSV.
</p>

In [ ]:
import csv
with open('Salaries.csv', newline='') as csvfile:
    reader = csv.reader(csvfile, delimiter=',')
    for row in reader:
        print(','.join(row))

# JSON
> ## JSON (JavaScript Object Notation) is a file format that stores data in a way that is easily readable by both humans and machines.
- It is as useful way for a browser and a server to exchange data, so it is used extensively in Web-based applications of coding.
- In fact, Jupyter Notebook .ipynb files are actually stored in JSON format.

In [ ]:
import json
with open('JSON_sample.json', mode='r') as f:
    json_dict = json.load(f)

print(json_dict)

with open('JSON_sample_new.json', mode='r') as f:
    json_dict_new = json.load(f)

print(json_dict_new)

We can save create json files from dictionaries

In [11]:
test_dict = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
with open('JSON_test.json', mode='w') as f:
    json.dump(test_dict, f)

We can also have a string containing a json and parse it

In [9]:
x =  '{"name": "John", "age": 30, "city": "New York"}'

In [12]:
y = json.loads(x)
print(y)
print(type(y))

{'name': 'John', 'age': 30, 'city': 'New York'}
<class 'dict'>

Be careful with the double quotes!

In [13]:
x =  "{'name': 'John', 'age': 30, 'city': 'New York'}"

In [14]:
y = json.loads(x)

JSONDecodeError: Expecting property name enclosed in double quotes: line 1 column 2 (char 1)

We do the opposite using the dumps method

In [15]:

test_dict = {'a': 3, 'b': 4}
new_json = json.dumps(test_dict)

In [16]:
new_json

'{"a": 3, "b": 4}'

# XLSX

There are many libraries that allow us to read xlsx files. One of the most famous is openpyxl

In [17]:
import openpyxl
wb_obj = openpyxl.load_workbook('demo.xlsx')
sheet = wb_obj.active

In [20]:
sheet['B2'].value

In [21]:
print(sheet.max_row)
print(sheet.max_column)

4
2

We can also create an xlsx file from Python

In [24]:
import xlsxwriter

# Create an new Excel file and add a worksheet.
workbook = xlsxwriter.Workbook('test.xlsx')
worksheet = workbook.add_worksheet()

# Write some simple text.
worksheet.write('A1', 'I am in the first cell!')

# Text with formatting.
worksheet.write('A2', 'Second position is not that bad')

# Write some numbers, with row/column notation.
worksheet.write(2, 0, 123)
worksheet.write(3, 0, 123.456)
worksheet.write(0, 1, 789)

workbook.close()

# YAML

YAML is a data serialization language, which means that it is a common language across different applications. In fact, you already saw a serialization language in this lesson: JSON.

> ## YAML (YAML Ain't Markup Language) is a data serialization language

The main advantage of YAML is that is highly human-readable. You can see a comparison between JSON and YAML containing the same information.
### YAML:
```
simple-property: a simple value

object-property:
    first-property: first value
    second-property: second value

array-property:
    - item-1-property-1: one
      item-1-property-2: 2
    - item-2-property-1: three
      item-2-property-2: 4
```

### JSON
```
{
  "simple-property": "a simple value",

  "object-property": {
      "first-property": "first value",
      "second-property": "second value",
  },

  "array-property": [
      { "item-1-property-1": "one",
        "item-1-property-2": 2 },
      { "item-2-property-1": "three",
        "item-2-property-2": 4}
  ]
}
```

Observe that the base of YAML files lies in the indentation and the linespaces.

The most basic syntax in a YAML file is the __key:value__ pair
```
key: value
```
For example:
```
# This is a comment
name: Ivan
surname: 'Ying'
role: "Instructor"
IQ: 0
```
Notice that strings can be either into double quotes, single quotes or nothing, and they will work the same.

Another useful way of using YAML files is leveraging __objects__ simply by indenting the key:value pairs:
```
# This is a comment
Person:
    name: Ivan
    surname: 'Ying'
    role: "Instructor"
    IQ: 0
```
Same as with Python, indentation should be at the right level, and it would be a good idea to have a linter for checking it.

You can look for `docs-yaml` in your Extensions tab on VSCode to install a linter to tell you whether your YAML file is well indented or not. Or you can also visit [this link](https://codebeautify.org/yaml-validator)

One more thing you can use in YAML files are lists. List can contain single values, or it can also contain key:value pair values
```
Person:
    - name: Ivan
      surname: 'Ying'
      role: "Instructor"
      IQ: 0
    - name: Not Ivan
      surname: 'Gniy'
      role: "Doppelganger"
      IQ: 150
Animals:
    - Cat
    - Dog
    - Shoebill
    - Kakapo
```
The last list can also be written as:
```
Animals: [Cat, Dog, Shoebill, Kakapo]
```

# Pandas

Pandas allows us to read these data formats in an easy way, so we don't have to think about the libraries or modules that we need to import

The syntax is as follows:

In [ ]:
import pandas as pd

df = pd.read_{format}('FILE_DIR')

df.to_{format}('FILE_DIR')

## Pandas and CSV
The syntax for reading in a CSV to pandas is thus:

In [ ]:
# we save the read_csv to a variable
df = pd.read_csv('<filename>')

# the to_csv method is a method off a data frame
df.to_csv('<filename>')

Example:

In [6]:
# import pandas
import pandas as pd

# read in the csv file
df = pd.read_csv('Salaries.csv', index_col='Id')

# show as DataFrame
df

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
672,CHERYL ADAMS,"HEAD ATTORNEY, CIVIL AND CRIMINAL",176856.18,0.00,3537.89,NaN,180394.07,180394.07,2011,NaN,San Francisco,NaN
673,LOUISE SIMPSON,"HEAD ATTORNEY, CIVIL AND CRIMINAL",176856.18,0.00,3537.80,NaN,180393.98,180393.98,2011,NaN,San Francisco,NaN
674,BLAKE LOEBS,"HEAD ATTORNEY, CIVIL AND CRIMINAL",176856.19,0.00,3537.75,NaN,180393.94,180393.94,2011,NaN,San Francisco,NaN
675,ELIZABETH AGUILAR-TARCHI,"HEAD ATTORNEY, CIVIL AND CRIMINAL",176856.17,0.00,3537.11,NaN,180393.28,180393.28,2011,NaN,San Francisco,NaN
676,JULIAN NG,SERGEANT III (POLICE DEPARTMENT),130457.76,43793.11,6061.80,NaN,180312.67,180312.67,2011,NaN,San Francisco,NaN

Let's get only the first 5 rows and save that into a new csv

In [8]:
df_short = df.head(5)
df_short
df_short.to_csv('Salaries_5.csv')

## Pandas and JSON

- Pandas can also read and write from and to JSON using the following commands.

In [13]:
# json
df = pd.read_json('JSON_sample.json')
df

                                           Employees
0  {'userId': 'person1', 'jobTitle': 'Developer',...
1  {'userId': 'person2', 'jobTitle': 'Developer',...
2  {'userId': 'person3', 'jobTitle': 'Program Dir...

This doesn't look good... We have to normalize each value in that column, so each key corresponds to a column

In [11]:
df['Employees']

0    {'userId': 'person1', 'jobTitle': 'Developer',...
1    {'userId': 'person2', 'jobTitle': 'Developer',...
2    {'userId': 'person3', 'jobTitle': 'Program Dir...
Name: Employees, dtype: object

In [14]:
df_nice = pd.json_normalize(df["Employees"])
df_nice

,userId,jobTitle,firstName,lastName,employeeCode,region,phoneNumber,emailAddress,emailAddres
0,person1,Developer,Harry,Berg,E1,CA,123456,harry.berg@aicore.com,NaN
1,person2,Developer,Nihir,Vedd,E2,CA,1111111,NaN,nihir.vedd@aicore.com
2,person3,Program Directory,Joao,Pereira,E3,CA,2222222,joao.pereira@aicore.com,NaN

In [15]:
df_nice.to_json('JSON_sample_new.json')

## Pandas and XLSX
- pandas cannot read in formulas, macros or graphs, only raw data.
- Also, we must specify the sheetname to read in as a data frame or write to when using the read_excel and to_excel methods.

In [ ]:
# read_excel has the same file stipulations as all read_ methods
df = pd.read_excel('<filename>',sheet_name='<sheetname>')

# remember to specify sheet name with Excel files
df.to_excel('<filename>',sheet_name='<sheetname>')

Example:

In [16]:
df = pd.read_excel('test.xlsx')
df

           I am in the first cell!  789
0  Second position is not that bad  NaN
1                              123  NaN
2                          123.456  NaN

Observe that the empty values are transformed into NaN values.

There is something wrong with this... It is taking the first row of the Excel file as the columns

In [17]:
df = pd.read_excel('test.xlsx', header=None)
df

                                 0      1
0          I am in the first cell!  789.0
1  Second position is not that bad    NaN
2                              123    NaN
3                          123.456    NaN

That's better... But now it just give some numeric values to the columns

In [18]:
df = pd.read_excel('test.xlsx', header=None, names=['First_Column', 'Second_Column'])
df

                      First_Column  Second_Column
0          I am in the first cell!          789.0
1  Second position is not that bad            NaN
2                              123            NaN
3                          123.456            NaN

We can also specify the sheet we want to work with

In [19]:
df = pd.read_excel('demo.xlsx', sheet_name='Instructors')
df

    Id First Name Last Name
0  I01      Harry      Berg
1  I02     Szymon    Maszke
2  I03        Dan      Sanz
3  I04        Ali  Abdelaal
4  I05       Ivan      Ying

In [20]:
df = pd.read_excel('demo.xlsx', sheet_name='Students')
df

     Id First Name     Last Name
0   S01      Ahsan       Muzafar
1   S02       Alex     Henderson
2   S03  Ana-Maria          Dicu
3   S04      Bilal      Armiyawo
4   S05      Easha      Tu Razia
5   S06      Harry         Smith
6   S07      Mahta     Haghighat
7   S08    Mariana   Karavangeli
8   S09      Milan         Sajiv
9   S10    Olumide       Fatokun
10  S11      Ruby   Roach Ashton
11  S12      Semmi         Nyomi
12  S13     Shweta         Yadav
13  S14       Yuya            Ra

Or we can give numeric values if we know their relative position in the file:

In [21]:
df = pd.read_excel('demo.xlsx', sheet_name=1)
df

     Id First Name     Last Name
0   S01      Ahsan       Muzafar
1   S02       Alex     Henderson
2   S03  Ana-Maria          Dicu
3   S04      Bilal      Armiyawo
4   S05      Easha      Tu Razia
5   S06      Harry         Smith
6   S07      Mahta     Haghighat
7   S08    Mariana   Karavangeli
8   S09      Milan         Sajiv
9   S10    Olumide       Fatokun
10  S11      Ruby   Roach Ashton
11  S12      Semmi         Nyomi
12  S13     Shweta         Yadav
13  S14       Yuya            Ra

We can also load all of them, but this will return a dictionaries, where each value correspond to each dataframe:

In [22]:
df = pd.read_excel('demo.xlsx', sheet_name=None)
df

{'Instructors':     Id First Name Last Name
 0  I01      Harry      Berg
 1  I02     Szymon    Maszke
 2  I03        Dan      Sanz
 3  I04        Ali  Abdelaal
 4  I05       Ivan      Ying,
 'Students':      Id First Name     Last Name
 0   S01      Ahsan       Muzafar
 1   S02       Alex     Henderson
 2   S03  Ana-Maria          Dicu
 3   S04      Bilal      Armiyawo
 4   S05      Easha      Tu Razia
 5   S06      Harry         Smith
 6   S07      Mahta     Haghighat
 7   S08    Mariana   Karavangeli
 8   S09      Milan         Sajiv
 9   S10    Olumide       Fatokun
 10  S11      Ruby   Roach Ashton
 11  S12      Semmi         Nyomi
 12  S13     Shweta         Yadav
 13  S14       Yuya            Ra}

In [25]:
df['Students']

     Id First Name     Last Name
0   S01      Ahsan       Muzafar
1   S02       Alex     Henderson
2   S03  Ana-Maria          Dicu
3   S04      Bilal      Armiyawo
4   S05      Easha      Tu Razia
5   S06      Harry         Smith
6   S07      Mahta     Haghighat
7   S08    Mariana   Karavangeli
8   S09      Milan         Sajiv
9   S10    Olumide       Fatokun
10  S11      Ruby   Roach Ashton
11  S12      Semmi         Nyomi
12  S13     Shweta         Yadav
13  S14       Yuya            Ra

## Summary
- We now understand the basic file formats of CSV/XLSX/JSON.
- We now know how to read them into pandas.

## Further reading
The only further reading for this section is below, on importing XML files. Understanding how, why and when to do this requires some understanding of pandas, so it is recommended that you wait until you have some practise with pandas before attempting to learn this.

## Reference only: XML
- XML (eXtensible Markup Language) is another way of exchanging data between browsers and servers (JSON is an alternative to XML).
- Hence, like with JSON, we can use XML to obtain data from the web.
- XML is a markup language like HTML, so it contains data, and information on how to structure that data, but not how it is displayed.
- Hence we need an API to extract data from an XML file, and so there is no simple method to read an XML into pandas.
- You can use the following process although it is not the only possible way to do it:

- You can use this premade function to parse in XML files, which requires only 2 arguments:
    - The XML filename
    - The columns of the data frame (the fields in each observation in the XML file)

In [ ]:
import pandas as pd
import xml.etree.ElementTree as et

def parse_XML(xml_file, df_cols): 
    """Parse the input XML file and store the result in a pandas 
    DataFrame with the given columns. 
    
    The first element of df_cols is supposed to be the identifier 
    variable, which is an attribute of each node element in the 
    XML data; other features will be parsed from the text content 
    of each sub-element. 
    """
    
    xtree = et.parse(xml_file)
    xroot = xtree.getroot()
    rows = []
    
    for node in xroot: 
        res = []
        res.append(node.attrib.get(df_cols[0]))
        for el in df_cols[1:]: 
            if node is not None and node.find(el) is not None:
                res.append(node.find(el).text)
            else: 
                res.append(None)
        rows.append({df_cols[i]: res[i] 
                     for i, _ in enumerate(df_cols)})
    
    out_df = pd.DataFrame(rows, columns=df_cols)
        
    return out_df

In [ ]:
df = parse_XML("employees.xml", ["name", "email", "department", "age"])
df